#+OPTIONS: H:3 num:nil toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS: author:nil email:nil creator:nil timestamp:nil
#+TITLE: Emacs init file written in org-mode
#+STARTUP: indent
#+SETUPFILE: ~/org/org-templates/level-1.org
#+LANGUAGE: en
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+HTML_HEAD: <link rel="stylesheet" title="Standard" href="../css/worg.css" type="text/css" />
#+HTML_HEAD: <script type="text/javascript"><?php include ("libjs/layersmenu-browser_detection.js"); ?></script>
#+HTML_HEAD: <link rel="stylesheet" href="../layerstreemenu.css" type="text/css"></link>
#+HTML_HEAD: <script type="text/javascript" src="libjs/layerstreemenu-cookies.js"></script>
#+PROPERTY: header-args :eval never-export
#+XSLT: 

#+LANGUAGE: en
#+TAGS: LUKA(L) ARNAUD(A) WEB(W) VINICIUS(V) noexport(n)

This file is my =.emacs= configuration file (more precisely my
=~/.emacs.d/init.el= configuration). I stole it from Luka Stanisic who
stole parts from mine a long time ago and cleaned (with org-mode) and
improved everything. It is so convenient that I think it is time to
share it. Note that it comprises my personal website publishing
configuration that you should not really need but that you can inspire
on.

To have a nice emacs configuration, you'll need:
- emacs24 (>24.3) (this way installing through elpa will save you some
  time) and emacs-goodies (e.g., for color themes)
- org-mode > 8.2 (there has been a major compatibility breakage so
  need to stay away from old versions)
- ess and R
- texlive and auctex
If you're a Mac OS X user, [[file:../blog/2014/05/15/emacs_and_orgmode_on_macosx.org][read this]].

** Default directory
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org/")
#+END_SRC

#+RESULTS: 
: ~/org/
*** Add short cut keys for the org-agenda                            :ARNAUD:
#+BEGIN_SRC emacs-lisp
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cc" 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map (kbd "C-c a") 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(setq org-default-notes-file "~/org/notes.org")
     (define-key global-map "\C-cd" 'org-capture)
(setq org-capture-templates (quote (("t" "Todo" entry (file+headline "~/org/liste.org" "Tasks") "* TODO %?
  %i
  %a" :prepend t) ("j" "Journal" entry (file+datetree "~/org/journal.org") "* %?
Entered on %U
  %i
  %a"))))
#+END_SRC

#+RESULTS: 
| t | Todo    | entry | (file+headline ~/org/liste.org Tasks) | * TODO %?\n  %i\n  %a           | :prepend | t |
| j | Journal | entry | (file+datetree ~/org/journal.org)     | * %?\nEntered on %U\n  %i\n  %a |          |   |

*** Google agenda                                                    :ARNAUD:
#+BEGIN_SRC emacs-lisp
(setq org-agenda-files (quote ("~/org/liste.org" "~/org/google.org")))
(setq revert-without-query (quote ("google.org")))
#+END_SRC

#+RESULTS: 
| google.org |

*** With capital letters:
To use this type <S and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("S" "#+begin_src ?\n\n#+end_src" "<src lang=\"?\">\n\n</src>"))
#+END_SRC

#+RESULTS: 
| B | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| b | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| R | #+BEGIN_SRC R :session\n\n#+END_SRC   | <src lang="R">\n\n</src>               |
| r | #+begin_src R :session\n\n#+end_src   | <src lang="R">\n\n</src>               |
| m | #+begin_src emacs-lisp\n\n#+end_src   | <src lang="emacs-lisp">\n\n</src>      |
| S | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| s | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| e | #+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE     | <example>\n?\n</example>               |
| q | #+BEGIN_QUOTE\n?\n#+END_QUOTE         | <quote>\n?\n</quote>                   |
| v | #+BEGIN_VERSE\n?\n#+END_VERSE         | <verse>\n?\n</verse>                   |
| V | #+BEGIN_VERBATIM\n?\n#+END_VERBATIM   | <verbatim>\n?\n</verbatim>             |
| c | #+BEGIN_CENTER\n?\n#+END_CENTER       | <center>\n?\n</center>                 |
| l | #+BEGIN_EXPORT latex\n?\n#+END_EXPORT | <literal style="latex">\n?\n</literal> |
| L | #+LaTeX:                              | <literal style="latex">?</literal>     |
| h | #+BEGIN_EXPORT html\n?\n#+END_EXPORT  | <literal style="html">\n?\n</literal>  |
| H | #+HTML:                               | <literal style="html">?</literal>      |
| a | #+BEGIN_ASCII\n?\n#+END_ASCII         |                                        |
| A | #+ASCII:                              |                                        |
| i | #+INDEX: ?                            | #+INDEX: ?                             |
| I | #+INCLUDE: %file ?                    | <include file=%file markup="?">        |

*** Emacs-elisp code:
To use this type <m and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("m" "#+begin_src emacs-lisp\n\n#+end_src" "<src lang=\"emacs-lisp\">\n\n</src>"))
#+END_SRC

#+RESULTS: 
| B | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| b | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| R | #+BEGIN_SRC R :session\n\n#+END_SRC   | <src lang="R">\n\n</src>               |
| r | #+begin_src R :session\n\n#+end_src   | <src lang="R">\n\n</src>               |
| m | #+begin_src emacs-lisp\n\n#+end_src   | <src lang="emacs-lisp">\n\n</src>      |
| S | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| s | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| e | #+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE     | <example>\n?\n</example>               |
| q | #+BEGIN_QUOTE\n?\n#+END_QUOTE         | <quote>\n?\n</quote>                   |
| v | #+BEGIN_VERSE\n?\n#+END_VERSE         | <verse>\n?\n</verse>                   |
| V | #+BEGIN_VERBATIM\n?\n#+END_VERBATIM   | <verbatim>\n?\n</verbatim>             |
| c | #+BEGIN_CENTER\n?\n#+END_CENTER       | <center>\n?\n</center>                 |
| l | #+BEGIN_EXPORT latex\n?\n#+END_EXPORT | <literal style="latex">\n?\n</literal> |
| L | #+LaTeX:                              | <literal style="latex">?</literal>     |
| h | #+BEGIN_EXPORT html\n?\n#+END_EXPORT  | <literal style="html">\n?\n</literal>  |
| H | #+HTML:                               | <literal style="html">?</literal>      |
| a | #+BEGIN_ASCII\n?\n#+END_ASCII         |                                        |
| A | #+ASCII:                              |                                        |
| i | #+INDEX: ?                            | #+INDEX: ?                             |
| I | #+INCLUDE: %file ?                    | <include file=%file markup="?">        |

*** R code:
To use this type <r and then TAB. This creates an R block for textual output.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("r" "#+begin_src R :results output :exports both :session *R*\n\n#+end_src" "<src lang=\"R\">\n\n</src>"))
#+END_SRC

#+RESULTS: 
| B | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| b | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| R | #+BEGIN_SRC R :session\n\n#+END_SRC   | <src lang="R">\n\n</src>               |
| r | #+begin_src R :session\n\n#+end_src   | <src lang="R">\n\n</src>               |
| m | #+begin_src emacs-lisp\n\n#+end_src   | <src lang="emacs-lisp">\n\n</src>      |
| S | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| s | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| e | #+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE     | <example>\n?\n</example>               |
| q | #+BEGIN_QUOTE\n?\n#+END_QUOTE         | <quote>\n?\n</quote>                   |
| v | #+BEGIN_VERSE\n?\n#+END_VERSE         | <verse>\n?\n</verse>                   |
| V | #+BEGIN_VERBATIM\n?\n#+END_VERBATIM   | <verbatim>\n?\n</verbatim>             |
| c | #+BEGIN_CENTER\n?\n#+END_CENTER       | <center>\n?\n</center>                 |
| l | #+BEGIN_EXPORT latex\n?\n#+END_EXPORT | <literal style="latex">\n?\n</literal> |
| L | #+LaTeX:                              | <literal style="latex">?</literal>     |
| h | #+BEGIN_EXPORT html\n?\n#+END_EXPORT  | <literal style="html">\n?\n</literal>  |
| H | #+HTML:                               | <literal style="html">?</literal>      |
| a | #+BEGIN_ASCII\n?\n#+END_ASCII         |                                        |
| A | #+ASCII:                              |                                        |
| i | #+INDEX: ?                            | #+INDEX: ?                             |
| I | #+INCLUDE: %file ?                    | <include file=%file markup="?">        |

To use this type <R and then TAB. This creates an R block for graphics
that are stored in the =/tmp/=.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("R" "#+begin_src R :results output graphics :file (org-babel-temp-file \"figure\" \".png\") :exports both :width 600 :height 400 :session *R* \n\n#+end_src" "<src lang=\"R\">\n\n</src>"))
#+END_SRC

#+RESULTS: 
| B | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| b | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| R | #+BEGIN_SRC R :session\n\n#+END_SRC   | <src lang="R">\n\n</src>               |
| r | #+begin_src R :session\n\n#+end_src   | <src lang="R">\n\n</src>               |
| m | #+begin_src emacs-lisp\n\n#+end_src   | <src lang="emacs-lisp">\n\n</src>      |
| S | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| s | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| e | #+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE     | <example>\n?\n</example>               |
| q | #+BEGIN_QUOTE\n?\n#+END_QUOTE         | <quote>\n?\n</quote>                   |
| v | #+BEGIN_VERSE\n?\n#+END_VERSE         | <verse>\n?\n</verse>                   |
| V | #+BEGIN_VERBATIM\n?\n#+END_VERBATIM   | <verbatim>\n?\n</verbatim>             |
| c | #+BEGIN_CENTER\n?\n#+END_CENTER       | <center>\n?\n</center>                 |
| l | #+BEGIN_EXPORT latex\n?\n#+END_EXPORT | <literal style="latex">\n?\n</literal> |
| L | #+LaTeX:                              | <literal style="latex">?</literal>     |
| h | #+BEGIN_EXPORT html\n?\n#+END_EXPORT  | <literal style="html">\n?\n</literal>  |
| H | #+HTML:                               | <literal style="html">?</literal>      |
| a | #+BEGIN_ASCII\n?\n#+END_ASCII         |                                        |
| A | #+ASCII:                              |                                        |
| i | #+INDEX: ?                            | #+INDEX: ?                             |
| I | #+INCLUDE: %file ?                    | <include file=%file markup="?">        |

To use this type <RR and then TAB. This creates an R block for
graphics that are stored in the directory of the current file.

#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("RR" "#+begin_src R :results output graphics :file  (org-babel-temp-file (concat (file-name-directory (or load-file-name buffer-file-name)) \"figure-\") \".png\") :exports both :width 600 :height 400 :session *R* \n\n#+end_src" "<src lang=\"R\">\n\n</src>"))
#+END_SRC

*** Bash "sh" code:
To use this type <b and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("b" "#+begin_src shell :results output :exports both\n\n#+end_src" "<src lang=\"sh\">\n\n</src>"))
#+END_SRC

#+RESULTS: 
| B | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| b | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| R | #+BEGIN_SRC R :session\n\n#+END_SRC   | <src lang="R">\n\n</src>               |
| r | #+begin_src R :session\n\n#+end_src   | <src lang="R">\n\n</src>               |
| m | #+begin_src emacs-lisp\n\n#+end_src   | <src lang="emacs-lisp">\n\n</src>      |
| S | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| s | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| e | #+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE     | <example>\n?\n</example>               |
| q | #+BEGIN_QUOTE\n?\n#+END_QUOTE         | <quote>\n?\n</quote>                   |
| v | #+BEGIN_VERSE\n?\n#+END_VERSE         | <verse>\n?\n</verse>                   |
| V | #+BEGIN_VERBATIM\n?\n#+END_VERBATIM   | <verbatim>\n?\n</verbatim>             |
| c | #+BEGIN_CENTER\n?\n#+END_CENTER       | <center>\n?\n</center>                 |
| l | #+BEGIN_EXPORT latex\n?\n#+END_EXPORT | <literal style="latex">\n?\n</literal> |
| L | #+LaTeX:                              | <literal style="latex">?</literal>     |
| h | #+BEGIN_EXPORT html\n?\n#+END_EXPORT  | <literal style="html">\n?\n</literal>  |
| H | #+HTML:                               | <literal style="html">?</literal>      |
| a | #+BEGIN_ASCII\n?\n#+END_ASCII         |                                        |
| A | #+ASCII:                              |                                        |
| i | #+INDEX: ?                            | #+INDEX: ?                             |
| I | #+INCLUDE: %file ?                    | <include file=%file markup="?">        |

To use this type <B and then TAB. This comes with a session argument
(e.g., in case you want to keep ssh connexions open).
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("B" "#+begin_src shell :session *shell* :results output :exports both \n\n#+end_src" "<src lang=\"sh\">\n\n</src>"))
#+END_SRC

#+RESULTS: 
| B | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| b | #+begin_src sh\n\n#+end_src           | <src lang="sh">\n\n</src>              |
| R | #+BEGIN_SRC R :session\n\n#+END_SRC   | <src lang="R">\n\n</src>               |
| r | #+begin_src R :session\n\n#+end_src   | <src lang="R">\n\n</src>               |
| m | #+begin_src emacs-lisp\n\n#+end_src   | <src lang="emacs-lisp">\n\n</src>      |
| S | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| s | #+BEGIN_SRC ?\n\n#+END_SRC            | <src lang="?">\n\n</src>               |
| e | #+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE     | <example>\n?\n</example>               |
| q | #+BEGIN_QUOTE\n?\n#+END_QUOTE         | <quote>\n?\n</quote>                   |
| v | #+BEGIN_VERSE\n?\n#+END_VERSE         | <verse>\n?\n</verse>                   |
| V | #+BEGIN_VERBATIM\n?\n#+END_VERBATIM   | <verbatim>\n?\n</verbatim>             |
| c | #+BEGIN_CENTER\n?\n#+END_CENTER       | <center>\n?\n</center>                 |
| l | #+BEGIN_EXPORT latex\n?\n#+END_EXPORT | <literal style="latex">\n?\n</literal> |
| L | #+LaTeX:                              | <literal style="latex">?</literal>     |
| h | #+BEGIN_EXPORT html\n?\n#+END_EXPORT  | <literal style="html">\n?\n</literal>  |
| H | #+HTML:                               | <literal style="html">?</literal>      |
| a | #+BEGIN_ASCII\n?\n#+END_ASCII         |                                        |
| A | #+ASCII:                              |                                        |
| i | #+INDEX: ?                            | #+INDEX: ?                             |
| I | #+INCLUDE: %file ?                    | <include file=%file markup="?">        |

[18:23:44; 21.06.2013]
** General articles                                                    :LUKA:
I'm not completely sure I need this. I could probably remove it...
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes '("article" "\\documentclass{article}\n \[NO-DEFAULT-PACKAGES]\n \[EXTRA]\n  \\usepackage{graphicx}\n  \\usepackage{hyperref}"  ("\\section{%s}" . "\\section*{%s}") ("\\subsection{%s}" . "\\subsection*{%s}")                       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")                       ("\\paragraph{%s}" . "\\paragraph*{%s}")                       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC

#+RESULTS: 
| article             | \documentclass{article}\n [NO-DEFAULT-PACKAGES]\n [EXTRA]\n  \usepackage{graphicx}\n  \usepackage{hyperref}             | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s}) | (\subparagraph{%s} . \subparagraph*{%s}) |
| acm-proc-article-sp | \documentclass{acm_proc_article-sp}\n [NO-DEFAULT-PACKAGES]\n [EXTRA]\n  \usepackage{graphicx}\n  \usepackage{hyperref} | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s}) | (\subparagraph{%s} . \subparagraph*{%s}) |

[15:18:27; 16.05.2013]
